20240810T122445--kdoc-217-『基礎からきっちり覚える-機械語入門』__draft_book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-09-24 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 217: 『基礎からきっちり覚える 機械語入門』</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 217: 『基礎からきっちり覚える 機械語入門』</h1>

<div id="outline-container-orgebc58e3" class="outline-2">
<h2 id="orgebc58e3"><a href="#orgebc58e3">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgebc58e3">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge14fd0e" class="outline-2">
<h2 id="orge14fd0e"><a href="#orge14fd0e">概要</a></h2>
<div class="outline-text-2" id="text-orge14fd0e">
<p>
<a href="https://www.amazon.co.jp/gp/product/B00JXBRF5U/ref=ppx_yo_dt_b_d_asin_title_351_o00?ie=UTF8&amp;psc=1">基礎からきっちり覚える 機械語入門</a>は、機械語を一般の人向けに解説する本。
</p>
</div>
</div>
<div id="outline-container-org1a11ca7" class="outline-2">
<h2 id="org1a11ca7"><a href="#org1a11ca7">メモ</a></h2>
<div class="outline-text-2" id="text-org1a11ca7">
<ul class="org-ul">
<li>コンピュータがどのように動作するかというイメージを掴むためには、実は機械語を見てみるのが一番の早道である。機械語の動作が理解できれば、その上で動く高級言語やOSなどの動作も非常にわかりやすくなる、という</li>
<li>10進2進16進対応表(p44)</li>
<li>除算というのは負荷の大きな演算であり、加算などの演算に比べると、実行に要する時間がはるかに長い(p51)</li>
<li>CPUの処理がもっとも効率よく行われるのはバイト、ワード、ダブルワードの各データ型に対してである(p55)</li>
<li>説明用の機械語を定義している。レジスタはなく、すべてメモリで制御する</li>
<li>値ではなく、そのアドレスの値を参照する命令がある。なぜ間接参照が必要なのかというと、この機能がないとあらかじめ分かっている番地にしかデータを書けないから。たとえば、ユーザの入力はあらかじめわからない。間接参照があると、入力した値をメモリに保管しておけば、あとはそのメモリを参照して使える(p136)</li>
<li>値X、X番地の値、X番地が指す値(X番地にある値をアドレスとみなし、その番地の中身に書かれている値)の3つ
<ul class="org-ul">
<li>即値、直接参照、間接参照</li>
</ul></li>
<li>排他的論理和は片方だけが真のときのみ全体が真になる論理演算。「私はAまたはBどちらかと結婚します」というような場合。両方は犯罪となる</li>
</ul>
</div>
</div>

<div id="outline-container-org2bb4fb7" class="outline-2">
<h2 id="org2bb4fb7"><a href="#org2bb4fb7">関連</a></h2>
<div class="outline-text-2" id="text-org2bb4fb7">
</div>
</div>


<div id="outline-container-org05cc20d" class="outline-2">
<h2 id="org05cc20d"><a href="#org05cc20d">Backlinks</a></h2>
<div class="outline-text-2" id="text-org05cc20d">
<ul class="org-ul">
<li><a href="./20240919T002306--kdoc-243-シフト演算命令に変換されるのを確かめる__draft_code.html">KDOC 243: シフト演算命令に変換されるのを確かめる</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
